app/controllers/twitts_controller.rb

  def index
    @twitts =  Twitt.all
---
SELECT "twitts".* FROM "twitts"

  def create
    @twitt = Twitt.new(params.require(:twitt).permit(:twitt))
    @twitt.user_id = current_user.id

    @twitt.save
---
INSERT INTO "twitts" ("created_at", "twitt", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-04 08:37:13.432511"], ["twitt", "jbb"], ["updated_at", "2014-10-04 08:37:13.432511"], ["user_id", 1]]

  def show
    @twitts = Twitt.where(user_id: params[:id])
---
SELECT "twitts".* FROM "twitts"  WHERE "twitts"."user_id" = 1